Terraform Plan against **dev** environment
```bash
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.demo-cicd.aws_s3_bucket.demo: Refreshing state... [id=concourse-demo-dev-s3-bucket]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo-cicd.aws_s3_bucket.demo must be replaced
-/+ resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::concourse-demo-dev-s3-bucket" -> (known after apply)
      ~ bucket                      = "concourse-demo-dev-s3-bucket" -> "concourse-demo-dev-bucket" # forces replacement
      ~ bucket_domain_name          = "concourse-demo-dev-s3-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "concourse-demo-dev-s3-bucket.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "concourse-demo-dev-s3-bucket" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

